package constants

var (
	MainColumns     = []interface{}{"№", "Наименование", "Доп. информация", "Количество", "Цена", "Сумма", "Себестоимость", "Шаблон"}
	TemplateColumns = []interface{}{"№", "Наименование", "Доп. информация", "Количество", "Ед. изм.", "Цена", "Сумма", "Шаблон"}

	SnpColumns = []interface{}{
		"№", "Наименование", "Д4", "Д3", "Д2", "Д1", "h", "материал внутр. кольца", "материал каркаса", "материал наполнителя",
		"материал нар. кольца", "Перемычка", "Отверстие", "Крепление", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}

	PutgColumns = []interface{}{
		"№", "Наименование", "D нар.", "D вн.", "Толщина прокладки, мм", "Обтюраторы", "Материал перфорации", "Материал обтюраторов", "Слюда",
		"Ингибитор", "Разъемная прокладка", "Перемычка", "Отверстие", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}
	PutgWithRingsColumn = []interface{}{
		"№", "Наименование", "D нар. огр.", "D нар.", "D вн.", "D вн. огр.", "Толщина прокладки, мм", "Обтюраторы", "Материал перфорации",
		"Материал нар. огр. кольца", "Материал обтюраторов", "Материал вн. огр. кольца", "Слюда", "Ингибитор", "Разъемная прокладка", "Перемычка",
		"Отверстие", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}
	PutgNotRounding = []interface{}{
		"№", "Наименование", "D нар.", "D вн.", "Поле", "Толщина прокладки, мм", "Обтюраторы", "Материал перфорации", "Материал обтюраторов",
		"Слюда", "Ингибитор", "Перемычка", "Отверстие", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}

	WaveColumns = []interface{}{
		"№", "Наименование", "Д4", "Д3", "Д2", "Д1", "Толщина", "Конструкция", "Обтюратор", "Материал основания", "Материал обтюраторов",
		"Материал плакировки", "Перемычка", "Отверстие", "Крепление", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}
	WaveNotRoundColumns = []interface{}{
		"№", "Наименование", "Вид прокладки", "Длина", "Ширина", "Поле", "Толщина", "Обтюратор", "Материал основания", "Материал обтюраторов",
		"Материал плакирующего слоя", "Перемычка", "Отверстие", "Крепление", "Чертеж", "Себестоимость", "Цена", "Шаблон",
	}

	SerratedColumns = []interface{}{
		"№", "Наименование", "Д4", "Д3", "Д2", "Д1", "Толщина мет. основания", "Конструкция", "Обтюратор", "Материал основания",
		"Материал обтюраторов", "Материал плакировки", "Материал нар кольца", "Перемычка (тип)", "Отверстие", "Крепление", "Чертеж",
		"Себестоимость", "Цена", "Шаблон",
	}
)
